Our merging document for the tables

In [139]:
#First we have to load all necessary libraries

import pandas as pd
import numpy as np
import psycopg2 
import requests 
from zipfile import *
from sql_functions import get_engine
import sqlalchemy

In [140]:
import sql_functions as sf
from sql_functions import get_dataframe
schema = 'roundnet'

After loading the necessary libraries we have to load the tables. As we have tables, there we want to add only one column from we want add them first before merging everything into one table. So we start with loading the surface into the tournament table

In [141]:
surface1= f'select * FROM {schema}.surface'
surface = get_dataframe(surface1)
surface.head()

   surface_id        name
0           1       Grass
1           2        Sand
2           3  Kunstrasen
3           4      Indoor
4           5        Snow

In [142]:
tournament1= f'select * FROM {schema}.tournament'
tournament_pre = get_dataframe(tournament1)
tournament_pre.head()

,event_id,event_name,date,location,surface_id,latitude,longitude,rating_tournament
0,8,Kiel Roundnet Open,2020-01-19,Kiel,4.0,54.322708,10.135555,0
1,29,Roundnet World Championships 2022,2022-09-08,Molenheide,1.0,51.082587,5.399360,0
2,102,EURA Grand Slam Freiburg,2022-07-30,Freiburg,1.0,47.990880,7.827049,0
3,2,Siegerland Open 2019,2019-11-16,Burbach,4.0,50.745600,8.080300,0
4,45,1. Roundnet Open Dresden,2020-08-30,Dresden,2.0,51.050409,13.737262,0

In [143]:
tournament=tournament_pre.merge(surface, how='left', on='surface_id')

In [144]:
tournament.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 96 entries, 0 to 95
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   event_id           96 non-null     int64
 1   event_name         96 non-null     object
 2   date               96 non-null     object
 3   location           96 non-null     object
 4   surface_id         90 non-null     float64
 5   latitude           92 non-null     float64
 6   longitude          92 non-null     float64
 7   rating_tournament  96 non-null     int64
 8   name               90 non-null     object
dtypes: float64(3), int64(2), object(4)
memory usage: 7.5+ KB

In [145]:
tournament.head()

,event_id,event_name,date,location,surface_id,latitude,longitude,rating_tournament,name
0,8,Kiel Roundnet Open,2020-01-19,Kiel,4.0,54.322708,10.135555,0,Indoor
1,29,Roundnet World Championships 2022,2022-09-08,Molenheide,1.0,51.082587,5.399360,0,Grass
2,102,EURA Grand Slam Freiburg,2022-07-30,Freiburg,1.0,47.990880,7.827049,0,Grass
3,2,Siegerland Open 2019,2019-11-16,Burbach,4.0,50.745600,8.080300,0,Indoor
4,45,1. Roundnet Open Dresden,2020-08-30,Dresden,2.0,51.050409,13.737262,0,Sand

In [146]:
tournament.rename(columns={'name': 'surface'}, inplace=True)

In [147]:
tournament.drop('surface_id', inplace=True, axis=1)

Following adding country to club

In [148]:
country1= f'select * FROM {schema}.country'
country = get_dataframe(country1)
country.head()

   country_id            name
0           1         Germany
1           2         Belgium
2           3     Netherlands
3           4  Czech Republic
4           5          Poland

In [149]:
club1= f'select * FROM {schema}.club'
club_pre = get_dataframe(club1)
club_pre.head()

,club_id,club_name,founding_date,country_id,club_insta,city,latitude,longitude,rg_member
0,1,1. Roundnetclub Opladen,2018-10-05,1,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1
1,2,1. Roundnet Club Köln,2016-09-09,1,1.roundnetclubkoeln,Köln,50.935909,6.875135,1
2,3,Roundnet Raccoons,2018-02-01,1,roundnet_raccoons,Kassel,51.315455,9.492410,0
3,4,Roundnet 069,2018-10-14,1,roundnet069,Frankfurt,50.110644,8.682092,0
4,5,Roundnet Gießen,None,1,roundnet_giessen,Gießen,50.586207,8.674231,1

In [150]:
club_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   club_id        92 non-null     int64
 1   club_name      92 non-null     object
 2   founding_date  39 non-null     object
 3   country_id     92 non-null     int64
 4   club_insta     75 non-null     object
 5   city           92 non-null     object
 6   latitude       92 non-null     float64
 7   longitude      92 non-null     float64
 8   rg_member      92 non-null     int64
dtypes: float64(2), int64(3), object(4)
memory usage: 6.6+ KB

In [151]:
club=club_pre.merge(country, how='left', on='country_id')

In [152]:
club.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 92 entries, 0 to 91
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   club_id        92 non-null     int64
 1   club_name      92 non-null     object
 2   founding_date  39 non-null     object
 3   country_id     92 non-null     int64
 4   club_insta     75 non-null     object
 5   city           92 non-null     object
 6   latitude       92 non-null     float64
 7   longitude      92 non-null     float64
 8   rg_member      92 non-null     int64
 9   name           92 non-null     object
dtypes: float64(2), int64(3), object(5)
memory usage: 7.9+ KB

In [153]:
club.rename(columns={'name': 'country'}, inplace=True)

In [154]:
club.drop('country_id', inplace=True, axis=1)

In [155]:
club.head()

,club_id,club_name,founding_date,club_insta,city,latitude,longitude,rg_member,country
0,1,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1,Germany
1,2,1. Roundnet Club Köln,2016-09-09,1.roundnetclubkoeln,Köln,50.935909,6.875135,1,Germany
2,3,Roundnet Raccoons,2018-02-01,roundnet_raccoons,Kassel,51.315455,9.492410,0,Germany
3,4,Roundnet 069,2018-10-14,roundnet069,Frankfurt,50.110644,8.682092,0,Germany
4,5,Roundnet Gießen,None,roundnet_giessen,Gießen,50.586207,8.674231,1,Germany

Now adding the country also to the player table

In [156]:
player1= f'select * FROM {schema}.player'
player_pre = get_dataframe(player1)
player_pre.head()

,player_id,first_name,last_name,player_city,player_eusra_id,club_id,country_id,gender,active_since,birth_date,player_insta,player_rg_elo,player_elo_games_total,rg_member,elo_division
0,2,Martin,Lang,Leverkusen,GERML99,1.0,1.0,m,2019.0,None,martingudelaune,1142.0,187,1,3.0
1,4,Sebastian,Köss,Köln,GERSK100,1.0,1.0,m,2019.0,1983-06-25,Herr_sybbi,1049.0,85,1,3.0
2,14,Jana,Esser,,None,1.0,1.0,f,2019.0,1991-11-29,None,951.0,10,1,2.0
3,64,Leonard,Breitzmann,,GERLB56,10.0,1.0,m,NaN,None,None,1106.0,39,1,3.0
4,65,Matias,Bermejo Pasetti,Basel,ESPMP5,10.0,24.0,m,2017.0,1994-04-27,wavingwave,1212.0,53,1,4.0

In [157]:
player_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4115 entries, 0 to 4114
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   player_id               4115 non-null   int64
 1   first_name              4115 non-null   object
 2   last_name               4111 non-null   object
 3   player_city             3179 non-null   object
 4   player_eusra_id         297 non-null    object
 5   club_id                 1941 non-null   float64
 6   country_id              4055 non-null   float64
 7   gender                  4112 non-null   object
 8   active_since            510 non-null    float64
 9   birth_date              2106 non-null   object
 10  player_insta            311 non-null    object
 11  player_rg_elo           1504 non-null   float64
 12  player_elo_games_total  4115 non-null   int64
 13  rg_member               4115 non-null   int64
 14  elo_division            1504 non-null   float64
dtypes: float64(5), int64(3), object(7)
memory usage: 482.4+ KB

In [158]:
player=player_pre.merge(country, how='left', on='country_id')

In [159]:
player.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4115 entries, 0 to 4114
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   player_id               4115 non-null   int64
 1   first_name              4115 non-null   object
 2   last_name               4111 non-null   object
 3   player_city             3179 non-null   object
 4   player_eusra_id         297 non-null    object
 5   club_id                 1941 non-null   float64
 6   country_id              4055 non-null   float64
 7   gender                  4112 non-null   object
 8   active_since            510 non-null    float64
 9   birth_date              2106 non-null   object
 10  player_insta            311 non-null    object
 11  player_rg_elo           1504 non-null   float64
 12  player_elo_games_total  4115 non-null   int64
 13  rg_member               4115 non-null   int64
 14  elo_division            1504 non-null   float64
 15  name                    4055 non-null   object
dtypes: float64(5), int64(3), object(8)
memory usage: 546.5+ KB

In [160]:
player.rename(columns={'name': 'country'}, inplace=True)

In [161]:
player.drop('country_id', inplace=True, axis=1)

In [162]:
player.head()

,player_id,first_name,last_name,player_city,player_eusra_id,club_id,gender,active_since,birth_date,player_insta,player_rg_elo,player_elo_games_total,rg_member,elo_division,country
0,2,Martin,Lang,Leverkusen,GERML99,1.0,m,2019.0,None,martingudelaune,1142.0,187,1,3.0,Germany
1,4,Sebastian,Köss,Köln,GERSK100,1.0,m,2019.0,1983-06-25,Herr_sybbi,1049.0,85,1,3.0,Germany
2,14,Jana,Esser,,None,1.0,f,2019.0,1991-11-29,None,951.0,10,1,2.0,Germany
3,64,Leonard,Breitzmann,,GERLB56,10.0,m,NaN,None,None,1106.0,39,1,3.0,Germany
4,65,Matias,Bermejo Pasetti,Basel,ESPMP5,10.0,m,2017.0,1994-04-27,wavingwave,1212.0,53,1,4.0,Spain

In [163]:
player['club_id'].convert_dtypes()

0          1
1          1
2          1
3         10
4         10
        ...
4110    <NA>
4111    <NA>
4112    <NA>
4113    <NA>
4114      14
Name: club_id, Length: 4115, dtype: Int64

The second- last small table we want to add is the division_kat to division

In [164]:
division1= f'select * FROM {schema}.division'
division_pre = get_dataframe(division1)
division_pre.head()

,tournament_id,division_id,event_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery
0,3,4,2,16,,,None,0
1,4,2,2,16,,,None,0
2,5,4,3,64,,,None,0
3,6,3,3,32,,None,None,0
4,12,4,7,24,TBA,,None,0

In [165]:
division_kat1= f'select * FROM {schema}.division_kat'
division_kat= get_dataframe(division_kat1)
division_kat.head()

   division_id           name
0            1           Open
1            2  Mixed & Women
2            3          Women
3            4            Men
4            5          Mixed

In [166]:
division_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207 entries, 0 to 206
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   tournament_id         207 non-null    int64
 1   division_id           207 non-null    int64
 2   event_id              207 non-null    int64
 3   max_teams             207 non-null    int64
 4   starting_fee          207 non-null    object
 5   starting_fee_reduced  133 non-null    object
 6   livestream            34 non-null     object
 7   use_lottery           207 non-null    int64
dtypes: int64(5), object(3)
memory usage: 13.1+ KB

In [167]:
division=division_pre.merge(division_kat, how='left', on='division_id')

In [168]:
division.head()

,tournament_id,division_id,event_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery,name
0,3,4,2,16,,,None,0,Men
1,4,2,2,16,,,None,0,Mixed & Women
2,5,4,3,64,,,None,0,Men
3,6,3,3,32,,None,None,0,Women
4,12,4,7,24,TBA,,None,0,Men

In [169]:
division.rename(columns={'name': 'division'}, inplace=True)

In [170]:
division.head()

,tournament_id,division_id,event_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery,division
0,3,4,2,16,,,None,0,Men
1,4,2,2,16,,,None,0,Mixed & Women
2,5,4,3,64,,,None,0,Men
3,6,3,3,32,,None,None,0,Women
4,12,4,7,24,TBA,,None,0,Men

In [171]:
division.drop('division_id', inplace=True, axis=1)

In [172]:
division.head()

,tournament_id,event_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery,division
0,3,2,16,,,None,0,Men
1,4,2,16,,,None,0,Mixed & Women
2,5,3,64,,,None,0,Men
3,6,3,32,,None,None,0,Women
4,12,7,24,TBA,,None,0,Men

the last small table we wanna add is team to tteam to get in our starting table for the big one (tteam) the gender in, which information we have in team

In [173]:
tteam1= f'select * FROM {schema}.tteam'
tteam_pre = get_dataframe(tteam1)
tteam_pre.head()

,tournament_team_id,team_name,position,team_id,tournament_id,team_skill,team_rg_id,elo_diff,quali_points
0,68,Blockwurst,1.0,58,3,1,NaN,NaN,NaN
1,69,Mzungu,2.0,59,3,1,NaN,NaN,NaN
2,70,The Rangers,3.0,60,3,1,NaN,NaN,NaN
3,71,Spiking Raccoons,4.0,61,3,1,NaN,NaN,NaN
4,72,PaderSpikers,5.0,62,3,1,NaN,NaN,NaN

In [174]:
team1= f'select * FROM {schema}.team'
team = get_dataframe(team1)
team.head()

   team_id         team_name gender
0       58        Blockwurst     mm
1       59            Mzungu     mm
2       60       Big & Tasty     mm
3       61  Spiking Raccoons     mm
4       62         Paderoona     mm

In [175]:
tteam_pre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5515 entries, 0 to 5514
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   tournament_team_id  5515 non-null   int64
 1   team_name           5280 non-null   object
 2   position            4812 non-null   float64
 3   team_id             5515 non-null   int64
 4   tournament_id       5515 non-null   int64
 5   team_skill          5515 non-null   int64
 6   team_rg_id          3099 non-null   float64
 7   elo_diff            3099 non-null   float64
 8   quali_points        154 non-null    float64
dtypes: float64(4), int64(4), object(1)
memory usage: 387.9+ KB

In [176]:
tteam=tteam_pre.merge(team, how='left', on=['team_id','team_name'])

In [177]:
tteam.head(10)

,tournament_team_id,team_name,position,team_id,tournament_id,team_skill,team_rg_id,elo_diff,quali_points,gender
0,68,Blockwurst,1.0,58,3,1,NaN,NaN,NaN,mm
1,69,Mzungu,2.0,59,3,1,NaN,NaN,NaN,mm
2,70,The Rangers,3.0,60,3,1,NaN,NaN,NaN,NaN
3,71,Spiking Raccoons,4.0,61,3,1,NaN,NaN,NaN,mm
4,72,PaderSpikers,5.0,62,3,1,NaN,NaN,NaN,NaN
5,73,Schlammbeiser,6.0,63,3,1,NaN,NaN,NaN,mm
6,74,Bike'n'Spike,7.0,64,3,1,NaN,NaN,NaN,mm
7,75,Lang & Elend,8.0,65,3,1,NaN,NaN,NaN,mm
8,76,Team Erzquell,9.0,66,3,1,NaN,NaN,NaN,mm
9,77,Hau drauf!,10.0,67,3,1,NaN,NaN,NaN,mm

Now its time to try to generate our big one dataset

First we merge tournament on devision

In [178]:
tournament_division=division.merge(tournament, how='left', on='event_id')

In [182]:
tournament_division.head()

,tournament_id,max_teams,starting_fee,starting_fee_reduced,livestream,use_lottery,division,event_name,date,location,latitude,longitude,rating_tournament,surface
0,3,16,,,None,0,Men,Siegerland Open 2019,2019-11-16,Burbach,50.745600,8.080300,0.0,Indoor
1,4,16,,,None,0,Mixed & Women,Siegerland Open 2019,2019-11-16,Burbach,50.745600,8.080300,0.0,Indoor
2,5,64,,,None,0,Men,Indoor Roundnet Masters Germany 2020,2020-02-29,Köln,50.971288,6.859622,0.0,Indoor
3,6,32,,None,None,0,Women,Indoor Roundnet Masters Germany 2020,2020-02-29,Köln,50.971288,6.859622,0.0,Indoor
4,12,24,TBA,,None,0,Men,Schlammbeiser Open 2020,2020-02-22,Gießen,50.576796,8.664769,0.0,Indoor

In [181]:
tournament_division.drop('event_id', inplace=True, axis=1)

Next we connect the tournament_division to the tteam

In [186]:
tournament_tteam=tteam.merge(tournament_division, how='left', on='tournament_id')

In [190]:
tournament_tteam.drop('tournament_id', inplace=True, axis=1)

In [191]:
tournament_tteam.head()

,tournament_team_id,team_name,position,team_id,team_skill,team_rg_id,elo_diff,quali_points,gender,max_teams,...,livestream,use_lottery,division,event_name,date,location,latitude,longitude,rating_tournament,surface
0,68,Blockwurst,1.0,58,1,NaN,NaN,NaN,mm,16.0,...,None,0.0,Men,Siegerland Open 2019,2019-11-16,Burbach,50.7456,8.0803,0.0,Indoor
1,69,Mzungu,2.0,59,1,NaN,NaN,NaN,mm,16.0,...,None,0.0,Men,Siegerland Open 2019,2019-11-16,Burbach,50.7456,8.0803,0.0,Indoor
2,70,The Rangers,3.0,60,1,NaN,NaN,NaN,NaN,16.0,...,None,0.0,Men,Siegerland Open 2019,2019-11-16,Burbach,50.7456,8.0803,0.0,Indoor
3,71,Spiking Raccoons,4.0,61,1,NaN,NaN,NaN,mm,16.0,...,None,0.0,Men,Siegerland Open 2019,2019-11-16,Burbach,50.7456,8.0803,0.0,Indoor
4,72,PaderSpikers,5.0,62,1,NaN,NaN,NaN,NaN,16.0,...,None,0.0,Men,Siegerland Open 2019,2019-11-16,Burbach,50.7456,8.0803,0.0,Indoor

In [189]:
tournament_tteam.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5515 entries, 0 to 5514
Data columns (total 23 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   tournament_team_id    5515 non-null   int64
 1   team_name             5280 non-null   object
 2   position              4812 non-null   float64
 3   team_id               5515 non-null   int64
 4   tournament_id         5515 non-null   int64
 5   team_skill            5515 non-null   int64
 6   team_rg_id            3099 non-null   float64
 7   elo_diff              3099 non-null   float64
 8   quali_points          154 non-null    float64
 9   gender                4289 non-null   object
 10  max_teams             5161 non-null   float64
 11  starting_fee          5161 non-null   object
 12  starting_fee_reduced  3223 non-null   object
 13  livestream            943 non-null    object
 14  use_lottery           5161 non-null   float64
 15  division              5161 non-null   object
 16  event_name            4950 non-null   object
 17  date                  4950 non-null   object
 18  location              4950 non-null   object
 19  latitude              4950 non-null   float64
 20  longitude             4950 non-null   float64
 21  rating_tournament     4950 non-null   float64
 22  surface               4889 non-null   object
dtypes: float64(9), int64(4), object(10)
memory usage: 1.0+ MB

Now we have to create the player tables properly. As the have the clubs information only for players: we merge it first to players: from the first try of the merging we see, that we need to do some adjustment:

In [196]:
player.rename(columns={'country': 'player_country'}, inplace=True)

In [197]:
club.rename(columns={'country': 'club_country'}, inplace=True)

In [198]:
club.rename(columns={'rg_member': 'club_rg_member'}, inplace=True)

In [199]:
player.rename(columns={'rg_member': 'player_rg_member'}, inplace=True)

In [200]:
player_club=player.merge(club, how='left', on='club_id')

In [201]:
player_club.drop('club_id', inplace=True, axis=1)

In [202]:
player_club.head()

,player_id,first_name,last_name,player_city,player_eusra_id,gender,active_since,birth_date,player_insta,player_rg_elo,...,elo_division,player_country,club_name,founding_date,club_insta,city,latitude,longitude,club_rg_member,club_country
0,2,Martin,Lang,Leverkusen,GERML99,m,2019.0,None,martingudelaune,1142.0,...,3.0,Germany,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1.0,Germany
1,4,Sebastian,Köss,Köln,GERSK100,m,2019.0,1983-06-25,Herr_sybbi,1049.0,...,3.0,Germany,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1.0,Germany
2,14,Jana,Esser,,None,f,2019.0,1991-11-29,None,951.0,...,2.0,Germany,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1.0,Germany
3,64,Leonard,Breitzmann,,GERLB56,m,NaN,None,None,1106.0,...,3.0,Germany,Aachen Lobsters,None,roundnet_aachen,Aachen,50.776351,6.083862,0.0,Germany
4,65,Matias,Bermejo Pasetti,Basel,ESPMP5,m,2017.0,1994-04-27,wavingwave,1212.0,...,4.0,Spain,Aachen Lobsters,None,roundnet_aachen,Aachen,50.776351,6.083862,0.0,Germany

In [203]:
player_club.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4115 entries, 0 to 4114
Data columns (total 22 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   player_id               4115 non-null   int64
 1   first_name              4115 non-null   object
 2   last_name               4111 non-null   object
 3   player_city             3179 non-null   object
 4   player_eusra_id         297 non-null    object
 5   gender                  4112 non-null   object
 6   active_since            510 non-null    float64
 7   birth_date              2106 non-null   object
 8   player_insta            311 non-null    object
 9   player_rg_elo           1504 non-null   float64
 10  player_elo_games_total  4115 non-null   int64
 11  player_rg_member        4115 non-null   int64
 12  elo_division            1504 non-null   float64
 13  player_country          4055 non-null   object
 14  club_name               1940 non-null   object
 15  founding_date           1198 non-null   object
 16  club_insta              1846 non-null   object
 17  city                    1940 non-null   object
 18  latitude                1940 non-null   float64
 19  longitude               1940 non-null   float64
 20  club_rg_member          1940 non-null   float64
 21  club_country            1940 non-null   object
dtypes: float64(6), int64(3), object(13)
memory usage: 739.4+ KB

Now we wanna ad the tournament results to it from the players itself. therefore we need to load the table and make some further adjustments

In [204]:
tplayer1= f'select * FROM {schema}.tplayer'
tplayer = get_dataframe(tplayer1)
tplayer.head()

,id,player_rg_elo,player_id,tournament_id,elo_diff,elo_games,tournament_team_id
0,2688,1038,977,105.0,24,7,1059.0
1,2689,1011,957,105.0,-4,7,1061.0
2,2690,1011,956,105.0,-4,7,1061.0
3,2691,1111,116,105.0,22,7,1062.0
4,2692,1050,921,105.0,22,7,1062.0

In [205]:
tplayer.rename(columns={'player_rg_elo': 'starting_player_rg_elo'}, inplace=True)

In [206]:
tplayer.drop('tournament_id', inplace=True, axis=1)

In [207]:
tplayer.drop('id', inplace=True, axis=1)

In [213]:
tplayer.head()

   starting_player_rg_elo  player_id  elo_diff  elo_games  tournament_team_id
0                    1038        977        24          7              1059.0
1                    1011        957        -4          7              1061.0
2                    1011        956        -4          7              1061.0
3                    1111        116        22          7              1062.0
4                    1050        921        22          7              1062.0

now merging the player to the ttplayer, but on a right join to not miss players who not play an elo game.

In [214]:
tplayer_club=tplayer.merge(player_club, how='right', on='player_id')

In [215]:
tplayer_club.drop('player_id', inplace=True, axis=1)

In [216]:
tplayer_club.head()

,starting_player_rg_elo,elo_diff,elo_games,tournament_team_id,first_name,last_name,player_city,player_eusra_id,gender,active_since,...,elo_division,player_country,club_name,founding_date,club_insta,city,latitude,longitude,club_rg_member,club_country
0,1044.0,-6.0,9.0,1507.0,Martin,Lang,Leverkusen,GERML99,m,2019.0,...,3.0,Germany,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1.0,Germany
1,1038.0,36.0,12.0,1748.0,Martin,Lang,Leverkusen,GERML99,m,2019.0,...,3.0,Germany,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1.0,Germany
2,1074.0,-74.0,9.0,2045.0,Martin,Lang,Leverkusen,GERML99,m,2019.0,...,3.0,Germany,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1.0,Germany
3,1031.0,21.0,11.0,1177.0,Martin,Lang,Leverkusen,GERML99,m,2019.0,...,3.0,Germany,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1.0,Germany
4,1052.0,-8.0,10.0,1243.0,Martin,Lang,Leverkusen,GERML99,m,2019.0,...,3.0,Germany,1. Roundnetclub Opladen,2018-10-05,1.roundnetclubopladen,Leverkusen,51.062152,7.014899,1.0,Germany

In [217]:
tplayer_club.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7932 entries, 0 to 7931
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   starting_player_rg_elo  5321 non-null   float64
 1   elo_diff                5321 non-null   float64
 2   elo_games               5321 non-null   float64
 3   tournament_team_id      5170 non-null   float64
 4   first_name              7932 non-null   object
 5   last_name               7928 non-null   object
 6   player_city             6996 non-null   object
 7   player_eusra_id         1849 non-null   object
 8   gender                  7929 non-null   object
 9   active_since            2400 non-null   float64
 10  birth_date              4533 non-null   object
 11  player_insta            1494 non-null   object
 12  player_rg_elo           5321 non-null   float64
 13  player_elo_games_total  7932 non-null   int64
 14  player_rg_member        7932 non-null   int64
 15  elo_division            5321 non-null   float64
 16  player_country          7851 non-null   object
 17  club_name               5622 non-null   object
 18  founding_date           3782 non-null   object
 19  club_insta              5468 non-null   object
 20  city                    5622 non-null   object
 21  latitude                5622 non-null   float64
 22  longitude               5622 non-null   float64
 23  club_rg_member          5622 non-null   float64
 24  club_country            5622 non-null   object
dtypes: float64(10), int64(2), object(13)
memory usage: 1.6+ MB

In [219]:
tplayer_club.columns

Index(['starting_player_rg_elo', 'elo_diff', 'elo_games', 'tournament_team_id',
       'first_name', 'last_name', 'player_city', 'player_eusra_id', 'gender',
       'active_since', 'birth_date', 'player_insta', 'player_rg_elo',
       'player_elo_games_total', 'player_rg_member', 'elo_division',
       'player_country', 'club_name', 'founding_date', 'club_insta', 'city',
       'latitude', 'longitude', 'club_rg_member', 'club_country'],
      dtype='object')

Last step is to merge the tplayer_club to the tournament_tteam table as final roundnet table

In [220]:
roundnet=tournament_tteam.merge(tplayer_club, how='left', on='tournament_team_id')

In [221]:
roundnet.head()

,tournament_team_id,team_name,position,team_id,team_skill,team_rg_id,elo_diff_x,quali_points,gender_x,max_teams,...,elo_division,player_country,club_name,founding_date,club_insta,city,latitude_y,longitude_y,club_rg_member,club_country
0,68,Blockwurst,1.0,58,1,NaN,NaN,NaN,mm,16.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,69,Mzungu,2.0,59,1,NaN,NaN,NaN,mm,16.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,70,The Rangers,3.0,60,1,NaN,NaN,NaN,NaN,16.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,71,Spiking Raccoons,4.0,61,1,NaN,NaN,NaN,mm,16.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,72,PaderSpikers,5.0,62,1,NaN,NaN,NaN,NaN,16.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [222]:
roundnet.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8100 entries, 0 to 8099
Data columns (total 46 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   tournament_team_id      8100 non-null   int64
 1   team_name               7854 non-null   object
 2   position                7391 non-null   float64
 3   team_id                 8100 non-null   int64
 4   team_skill              8100 non-null   int64
 5   team_rg_id              5684 non-null   float64
 6   elo_diff_x              5684 non-null   float64
 7   quali_points            308 non-null    float64
 8   gender_x                6547 non-null   object
 9   max_teams               7746 non-null   float64
 10  starting_fee            7746 non-null   object
 11  starting_fee_reduced    5617 non-null   object
 12  livestream              1877 non-null   object
 13  use_lottery             7746 non-null   float64
 14  division                7746 non-null   object
 15  event_name              7535 non-null   object
 16  date                    7535 non-null   object
 17  location                7535 non-null   object
 18  latitude_x              7535 non-null   float64
 19  longitude_x             7535 non-null   float64
 20  rating_tournament       7535 non-null   float64
 21  surface                 7474 non-null   object
 22  starting_player_rg_elo  5170 non-null   float64
 23  elo_diff_y              5170 non-null   float64
 24  elo_games               5170 non-null   float64
 25  first_name              5170 non-null   object
 26  last_name               5170 non-null   object
 27  player_city             5164 non-null   object
 28  player_eusra_id         1733 non-null   object
 29  gender_y                5170 non-null   object
 30  active_since            2211 non-null   float64
 31  birth_date              3417 non-null   object
 32  player_insta            1381 non-null   object
 33  player_rg_elo           5170 non-null   float64
 34  player_elo_games_total  5170 non-null   float64
 35  player_rg_member        5170 non-null   float64
 36  elo_division            5170 non-null   float64
 37  player_country          5146 non-null   object
 38  club_name               4674 non-null   object
 39  founding_date           3241 non-null   object
 40  club_insta              4576 non-null   object
 41  city                    4674 non-null   object
 42  latitude_y              4674 non-null   float64
 43  longitude_y             4674 non-null   float64
 44  club_rg_member          4674 non-null   float64
 45  club_country            4674 non-null   object
dtypes: float64(20), int64(3), object(23)
memory usage: 2.9+ MB